from systemone import SystemOne
from time import time

with open("systemone.apikey", "r", encoding="utf-8") as rf:
    api_key = rf.read().strip()

so = SystemOne()
# so.use("typesafe", "jev-latest", api_key)
so.use("ollama", "tev1", "ollama")

# so.set_state("我的月度订阅被扣了两次款。能帮我核查一下这两笔付款吗？")

# so.addq("这属于资金问题吗？", "Q0", "noul")
# so.addq("这属于哪一类反馈？", dict.fromkeys(["故障或错误", "功能建议", "账单问题", "使用求助", "正面反馈", "其他"], None), "Q1", "choice")
# so.addq("该问题严重吗？", ["忽略", "注意", "警告", "严重"], "Q2", "score")

so.set_state("""对文学艺术创作者来说，或早或晚，都会遭遇到这个问题——为谁创作、为谁立言？“文学艺术创造、哲学社会科学研究首先要搞清楚为谁创作、为谁立言的问题，这是一个根本问题。人民是创作的源头活水，只有扎根人民，创作才能获得取之不尽、用之不竭的源泉。

目前，文艺界普遍认识到，只有与身处的时代积极互动，深刻回应时代重大命题，才会获得艺术创作的蓬勃生机。然而，在创作实践中，还有许多作家、艺术家困惑于现实是如此宏大丰富，以至于完全超出个人的认识和表现能力。我们常常听到这样的说法：现实太精彩了，它甚至远远走到了小说家想象力的前面。是的，我们有幸生活在这样一个日新月异的时代，随时发生着习焉不察而影响深远的变化。这就为作家、艺术家观察现实、理解生活带来巨大困难。对于他们而言，活灵活现地描绘出生活的现象和表象，大约是不难的，难就难在理解生活复杂的结构，理解隐藏在表象之下那些更深层的东西。那么，这“更深层的东西”是什么呢？\n\n去过天安门广场的朋友一定会对矗立在广场上的人民英雄纪念碑印象深刻，许多人都能背得出上面的碑文——“三年以来，在人民解放战争和人民革命中牺牲的人民英雄们永垂不朽！三十年以来，在人民解放战争和人民革命中牺牲的人民英雄们永垂不朽！由此上溯到一千八百四十年，从那时起，为了反对内外敌人，争取民族独立和人民自由幸福，在历次斗争中牺牲的人民英雄们永垂不朽！”在新中国成立70周年的今天，再次诵读这段话，我们就会意识到，这改天换地的宏伟现实是人民创造的，人民当之无愧是时代的英雄，是历史的创造者。只有认识到人民的主体地位，才能感受到奔涌的时代浪潮下面深藏的不竭力量，才有可能从整体上把握一个时代，认识沸腾的现实。\n\n认识人民创造历史的主体地位，是为了从理性和情感上把自己放到人民中间，是为了解决我是谁、我属于谁的问题。新文化运动以来，无论是经历革命与战争考验的现代作家，还是上世纪80年代那批经历了知青岁月的当代作家，他们内心其实都有一方情感根据地，都和某一片土地上的人民建立了非常深切的情感关系。这些作家是属于某个情感共同体的，这个共同体时刻提醒着他，他的生命和创作与这世界上更广大的人群休戚相关。一个普普通通的劳动者，或许并不是我们的读者，但这并不妨碍我们将他以及他所代表的广大人民作为我们认识现实、理解时代的依据。\n\n以人民为中心，就是要坚持以精品奉献人民。在新的时代条件下，我国文化产品供给的主要矛盾已经不是缺不缺、够不够的问题，而是好不好、精不精的问题。诚然，娱乐和消费也是人民群众精神文化需要的一部分，但是，有责任感的艺术家会深深感到，我们就生活在那些为美好生活、为民族复兴而奋斗的人们中间，理应对我们的共同奋斗负有共同责任。我们有责任通过形象的塑造，凝聚精神上的认同。这种认同，是对国家和民族未来的认同，是与新时代伟大历史进程的同频共振，作者和艺术家只有把自己看成人民的儿子，积极投身于人们争取美好未来的壮阔征程，才有能力创造出闪耀着明亮光芒的文艺，照亮和雕刻一个民族的灵魂。

（摘编自铁凝《照亮和雕刻民族的灵魂》）
""")

so.addq("下列关于原文内容的理解和分析,正确的一项是",
      {
        "A": "作家树立了与时代积极互动的理念，在创作实践中就能做到以人民为中心。",
        "B": "对人民的情感认同，是新文化运动以来很多作家创作取得成功的重要原因。",
        "C": "人民是认识现实、理解时代的依据，因为普通劳动者才是文艺最理想的读者。",
        "D": "真正扎根时代、富有责任感的艺术家，无须考虑人民群众的娱乐和消费需求。"
      },
      "Q1", "choice") # B
so.addq("下列对原文论证的相关分析,不正确的一项是",
      {
        "A": "文章采用提出问题、分析问题的方式展开论证，在逻辑上也是逐层递进的",
        "B": "文章论证兼顾现实与历史，既有对当下创作的分析，也有对历史经验的总结",
        "C": "文章引用人民英雄纪念碑碑文内容，巧妙衔接了上下文，也有力支撑了论点",
        "D": "文章末段论证了正面人物的塑造是新时代文艺“以人民为中心”的根本体现"
      },
      "Q2", "choice") # D
so.addq("根据原文内容，下列说法不正确的一项是",
      {
        "A": "对于那些认为现实走在小说家想象力前面的作家而言，困难在于如何把握生活的复杂结构和本质内容。",
        "B": "对艺术家而言，日新月异的变革时代，既意味着巨大挑战，也能激发创作热情，促使他们投身沸腾的生活",
        "C": "老舍曾说：“不去与劳动人民结为莫逆的好友，是写不出结结实实的作品的。”这与文中情感共同体的理念是相通的。",
        "D": "我国当下文化产品供给的主要矛盾已经由量的问题转向质的问题，艺术家的创作也应少而精，凝聚共识。"
      },
      "Q3", "choice") # D

_ts = time()
so.run()
_te = time()
so.show_ans()
print(f"Time cost: {_te - _ts:.2f}s")